{
  "project-three": {
    "title": "A Study on the Literacy uses in The Computer Science Learning Community at Purdue University",
    "body": "<h2>Introduction</h2><p>I am observing and researching the Computer Science Learning Community.  I expect to find similarities between all of the students because Computer Science, as a major, attracts a certain personality type and this is where the stereotypical coder comes from.  A stereotypical  coder is someone who locks himself in his room all day and codes.  They never come out and never sleep. Stereotypes are not true for the most part but since many of the people in the learning community have different aspects of the stereotype it will allow me to track the similarities in reading, writing, and communication between the members.  I will be interviewing a few of the members in-depth and having the rest of the members answer some general questions, so that I get an overall look at the community as well as an in-depth view into the group of computer scientists.   The Computer Science Learning Community also serves as my dorm floor which provides me with an extra layer of information that I can look at, because the community functions as two separate groups.  This allows me to see what everyone does outside of each community and what exactly brings us together at the end of the day as a dorm floor and the Computer Science Learning Community. Many of the goals of the community are the same as the ones described in Steps To Fostering A Learning Community In The Primary Science Classroom by Kimberley Pressick-Kilborn, such as \"study of topics in depth, focus problems, inquiry driven by students' questions, small group work focusing on different tasks that contribute to a central topic…\"(Kimberley Pressick-Kilborn 27).  Even though the article is written about a primary science classroom many of the goals still apply because they are still science related at the core.  Every year the Computer Science Learning Communities try to attract as many women as possible because the leaders know that they are part of a group of \"historically underrepresented and undeserved students, including women\"(Matthew Dorian Pistilli 2) as stated in  How Female Learning Community Students from the Colleges of  Engineering, Science, and Technology Experience Purdue University: A Qualitative Dissertation.  If the community can get women to join and then these same women become successful in the field of Computer Science then they become very attractive to tech companies because the companies are looking for more diversity so many time a women will get picked over a man if they have the same skill set.  As a result the learning community will be able to add more companies to their list of \"Companies that Students from the Computer Science Learning Community have Worked at\".</p><h2>Methods</h2><p>My methods have remained unchanged from my proposal. I am still talking to a few different people and then having other people in the community answer general questions.  I also plan on going to some of the events and observing the community as a whole and how we function together.  I will be asking about how many clubs people are involved in because it is interesting to see how different we all are because of what we like to do outside of computer science, but we all come back to function as a community at the end of the day.  Many of the people that are in the Computer Science Learning Community are in a lot of my classes so it should be very easy for me to go and talk to them about interviewing for this paper.  There have also been events that I have gone to that help me to see how the entire community functions as a whole. Such as, pumpkin carving, bowling nights or hunger hike.</p><h2>Preliminary Results</h2><p>Of the people that I interviewed they all seemed to like science fiction or thriller genres.  This helps me gain a better understanding of the community.  Most of the people have great imaginations and love to dream, which is why they enjoy fiction.   When they talked about their favorite books, they tended to include a high level academic book, like 1984 by George Orwell or Brave New World by Aldous Huxley, and a less academic book but still above the average reading level, like Do Androids Dream of Electric Sheep? by Philip K. Dick or Ender's Game by Orson Scott Card.  What this tells me is that, for the most part, the people in the community enjoy reading academic books but also like reading books that are not part of the curriculum.  From my research it is also very evident that many students rarely read for pleasure outside of school, this may be because they do not wish to spend time on things that are not required when their is a big load of work that is required that they need to get done.  When asked about how they use writing the most in their everyday lives, the people I interviewed said that they used writing to express ideas or thoughts, for writing Steam reviews, text messaging, occasionally a post on social media, but everyone of them said that they use writing the most often for coding and writing comments in their code.  Steam is a community where you can download and play games.  People will write Steam reviews on the users that are in the community or the games that they have played.  They also use reading almost everyday.  For many of the classes that we are in there are textbooks that they have to read to be ready for class the next session.  Reading is also used when surfing the internet, wasting time on social media, reading other people's code, text messages, and reading the slides during big lectures.  From the events that I have gone to, observing the group has brought some insight as to how the community functions.  In our community, we trust one another which keeps us accountable with other people in the community.  We all tend to leave our doors open when we are in our rooms so that if someone needs help they are able to ask and receive it.  Many of the students in the community that have lots of prior coding experience are asked to have their doors open and be open to getting asked questions about the current project or the homework's that are due later in the week.  This creates a great learning environment for students that are struggling in their classes because they always have people they can talk to and ask questions on things they don't understand.</p><h2>Preliminary Discussion</h2><p>For the most part, computer science majors enjoy writing if it is something that they are knowledgeable about.  Computer Science majors also enjoy writing about what they are passionate about and that is not just programming.  We are not all the stereotypical programmer who is lazy and sits in his dark room all day coding.  We are actual people that, for the most part, can be shy and a little timid but once you get to know us we are super cool people and want to talk to you. A lot of us are afraid of what others think about us.  The field of Computer Science contains a lot of guys and girls that are introverted, which means we want to get to know you but you will have to approach us because we will not.  This tends to be because we like having high level conversation, unlike many other people who only want to talk about the coolest designer shirt that just came out.  This can be evident when computer scientists publish writing, such as a masters' thesis or even books. Most of the content will be in regards to high level topics and it would be bad if someone who knew nothing about Computer Science or Applied Math tried to read it because it would be very hard to understand.  This stems from the certain personality that the major, Computer Science, attracts, introverts that are extremely smart.  People who are successful in this field of study, usually, at some point in their lives were labeled as an outcasts or  wallflowers, but as they learn more and have to start talking to people, whether it is to get a job or to continue friendships in their personal life, this creates introverted people that can portray extroverted qualities.  People like this are labeled as introverted-extroverts.  Some famous introverted-extroverts include Bill Gates and Steve Wozniak.  Both of them are leaders in the tech world and very important to the growth of the world's technology.</p><h2>Discussion of Results</h2><p>For the most part the Computer Science Learning Community communicates in the same fashion as many other communities.  We use GroupMe, Facebook Messenger, and Instant Messenger to communicate with other people in the community.  The community is different by how we let the residents know about upcoming events and the ways in which we use writing and reading.  For community wide events, and things in general that are good to know about, the Residential Assistant will post informational papers on our bulletin board, that is on our floor, and he will also send out an email to make sure everyone gets the news of upcoming events.  In regards to how the community uses writing, the most common use of writing is for writing code.  Code is a simple term for computer programs that solve any task, such as adding up the number of words in an essay or displaying a list of Fibonacci numbers.   Some other uses for writing in the community are, commenting the code we write, writing essays for english classes, texting friends, communicating with the rest of the residents in the community.  Commenting our code means that we write a description for what each line of our code does, so that when we come back a year later, or when someone else is reading our code, we can understand exactly what our code is doing without having to decipher it.    By analyzing the favorite genres and favorite books that were given to me, we can assume that the community, for the most part, likes fantasy and the people in the community have a powerful imagination and love to be entertained.  This goes to show that not everyone that studies Computer Science turns out to be the typical coder that is a hermit.  As a result our community communicates just like any other community but we do use writing in an entirely different way; instead of writing essays and papers, we write code to help make our lives easier and more stress free as a result.</p><h2>Activity Theory</h2><p>The Computer Science Learning Community uses tools like, GroupMe, and Facebook Messenger to communicate to the other members of the community. One of the tools we use the most often though, are computers, because we need them to write code for our classes and we use them run the tools that we communicate with.  Some of the motives of the community is to make friends and do some community service.  We also make friends now so that we will have connections when we are trying to get jobs later on in life.  Since the community is an academic community the rules mostly revolve around the same rules as in the classroom, which means no copying work, plagiarism etc.  The division of labor in the community is pretty simple.  There can be floor senators that represent us at community meeting, but besides that everyone is on the same level, which means that everyone has to do their own work.</p><h2>Appendecies</h2><h4>Interview Q&A</h4><p><b>What are some of your Favorite books?</b> John: My favorite books are 1984 by George Orwell and Game of Thrones by George R. R. Martin. Jacob: My favorite books are Do Android Dream of Electric Sheep? by Philip K. Dick and Brave New World by Aldous Huxley and Ender's Game by Orson Scott Card.  <b>Do you read for pleasure?</b>  John: I do not read for pleasure.  Jacob: Sometimes not very often though.  <b>What are you favorite genres, books or movies?</b>  John: My favorite genres are slice of life and thriller. Jacob: My favorite genres are Science Fiction, Comedy, and Action.  <b>In what ways do you use writing, can be essays, social media, text, code?</b>  John: I write Steam reviews, send text messages on a daily basis, occasionally tweet, and code everyday.  Jacob: Depending on the need I can use writing to express ideas and thoughts, some of that becomes code every now and then.  I most often use writing for messaging my friends and to write code.  <b>What type of writing are you best at or favorite type of writing?</b>  John: Definitely coding.  Jacob: Narratives, I like to tell dumb stories and make people laugh.</p><h4>Visual Rehtoric and Analysis</h4><p>The first example of visual rhetoric that I chose to use is the information poster that the Residential Assistant puts up each week on the dorm floor.  This lists upcoming events for the community, a philosophy quote and some interesting facts for the week.  There is also a funny comic usually posted at the bottom.  This post is from the week of Halloween so the comic strip is from Calvin and Hobbes and is Calvin explaining his costume as, \"I'm yet another resource-consuming kid in an overpopulated planet, raised to an alarming extent by Madison Avenue and Hollywood. Poised with my cynical and alienated peers to take over the world when you're old and weak! … Am I scary or what?\"(Bill Watterson).  This is funny yet philosophical.  The second piece of visual rhetoric that I chose was a design for the wall on our dorm floor.  What depicts is all of the smaller companies that some of the biggest companies own.  For example the company Mars owns Wrigley, which means that they now own just about every type of gum and breath mints.  Mars also owns Uncle Bens and most of the famous candy bars like Twix, M&Ms, Snickers and many others.  This is supposed to be informational to us as we get jobs because it always helps to know which company you are really working for when you get hired to work</p><img src=\"/assets/img/PetePost.jpg\"style=\"width:441.5px;height:600px;\"><img src=\"/assets/img/Companies.jpg\"style=\"width:600px;height:450px;\"><h4>Activity System</h4><img src=\"/assets/img/ActivitySystem.png\"style=\"width:755px;height:666px;\"><h2><center>Works Cited</center></h2><img src=\"/assets/img/WorksCited.png\"style=\"width:596px;height:250px;\"></p>",    
    "url": "project-three"
  }
}


